"""
# Домашнее задание №1: Основы NumPy

**Цель:**
Научиться самостоятельно создавать массивы NumPy и выполнять с ними базовые операции.

## Практическая часть:

1. **Создание массивов:**

   a) Создайте одномерный массив, содержащий числа от 5 до 25 включительно, с шагом 5.
   b) Создайте массив размером 3x3, заполненный единицами (`1`).
   c) Создайте массив размером 2x5, заполненный нулями (`0`).

---

2. **Работа со свойствами массивов:**

   Для массива `a = np.array([3, 6, 9, 12, 15, 18])`:

   - Определите количество измерений.
   - Найдите форму массива.
   - Узнайте его размер.

---

3. **Базовые операции:**

   Создайте массив от 1 до 10 включительно и:

   - Прибавьте к каждому элементу число 2.
   - Умножьте каждый элемент на 5.
   - Возведите каждый элемент в квадрат.

---

4. **Дополнительное задание:**

   - Создайте линейно распределённый массив из 7 чисел от 10 до 20 включительно.
   - Преобразуйте его в двумерный массив с размерностью `(7, 1)` (столбец).

# Подсказка:

При необходимости используйте команды:

np.arange()
np.zeros()
np.ones()
np.linspace()
.reshape()

"""