""" 
Task 1

Создайте четыре лямбда-функции: add, subtract, multiply, divide
Создайте словарь operations, где ключи '+', '-', '*', '/' будут соответствовать этим функциям
Напишите функцию calculate(a, b, operation), которая использует словарь operations

Пример вызова: calculate(10, 5, '+') должно вернуть 15
"""

# Task 1 - Ответ
# Ваш код тут ...

############## 

""" 
Task 2 - Форматирование данных

# Дан список имен в формате "фамилия, имя"
names = ["Smith, John", "Johnson, Mary", "Williams, Peter"]
# Используя lambda и map, преобразуйте список в формат "Имя Фамилия"
# Результат должен быть: ["John Smith", "Mary Johnson", "Peter Williams"]
"""

# Task 2 - Ответ
# Ваш код тут ...


################
# Task 3 - Фильтрация продуктов

products = [
    {"name": "Laptop", "price": 1000, "rating": 4.5},
    {"name": "Phone", "price": 500, "rating": 4.8},
    {"name": "Tablet", "price": 300, "rating": 4.2},
    {"name": "Watch", "price": 250, "rating": 4.9}
]

"""
# Создайте три разные lambda-функции для фильтрации:
# 1. Продукты дешевле 400
# 2. Продукты с рейтингом выше 4.5
# 3. Продукты дороже 400 и с рейтингом -выше 4.0
"""

# Task 3 - Ответ
# Ваш код тут ..



#########################

# Task 4 - Обработка текста

# Дан список предложений
sentences = [
    "Python is AWESOME",
    "LAMBDA functions are COOL",
    "PROGRAMMING is FUN"
]

# Используя lambda и map:
# 1. Преобразуйте все предложения к нижнему регистру
# 2. Посчитайте количество слов в каждом предложении
# 3. Удалите предложения, содержащие слово "fun" (любой регистр)


# Task 4 - Ответ
# Ваш код тут ..