""" 
Домашняя работа


Симуляция умного дома
Создайте абстрактный класс SmartDevice с методами:

turn_on()
turn_off()
get_status()
connect_to_network(network)

Реализуйте устройства:

SmartLight (с уровнем яркости и цветом)
SmartThermostat (с установкой и отслеживанием температуры)
SmartSocket (с мониторингом энергопотребления)

Создайте класс SmartHome, который может управлять всеми устройствами 
через абстрактный интерфейс и создавать сценарии автоматизации (например, "Выключить все устройства").
"""