""" 
Задание: Цепочное наследование

Создай три класса:

    Animal – базовый класс, который содержит:

        Поля: name (имя животного), age (возраст).

        Метод display_info(), который выводит информацию о животном.

    Mammal – наследуется от Animal, добавляет:

        Поле fur_color (цвет шерсти).

        Метод make_sound(), который выводит "Издаёт звук...".

    Dog – наследуется от Mammal, добавляет:

        Поле breed (порода).

        Метод bark(), который выводит "Гав-гав!".
"""