# Задание: Посчитайте сумму цифр числа с помощью рекурсии

"""
Задача: 
Напишите рекурсивную функцию sum_of_digits, которая принимает целое число n
и возвращает сумму всех его цифр.

Примеры:
sum_of_digits(123) -> 1 + 2 + 3 = 6
sum_of_digits(456) -> 4 + 5 + 6 = 15
sum_of_digits(7) -> 7

Ограничение: используйте только рекурсию (без циклов)
"""

# Ваш код здесь


# Проверка
print(sum_of_digits(123))  # Должно вывести 6
print(sum_of_digits(456))  # Должно вывести 15
print(sum_of_digits(7))    # Должно вывести 7
print(sum_of_digits(1234)) # Должно вывести 10
