"""
Задание 1. Работа с Series

    Создайте Series с элементами: [5, 15, 25, 35, 45]

    Выведите:

        - всю серию
        - значение первого элемента
        - сумму всех элементов
        - среднее значение элементов
--------
Задание 2. Создание DataFrame

    Создайте словарь students, содержащий:
    - name: список из 4 имен
    - math_score: оценки по математике
    - english_score: оценки по английскому

    Создайте DataFrame из словаря.

    Выведите:
    - первые 2 строки
    - столбец name
    - столбцы name и math_score
    - информацию о DataFrame (.info())
    - статистику (.describe())

--------
Задание 3. Изменение и добавление данных

    - Добавьте в DataFrame students новый столбец city (любые города).
    - Увеличьте math_score на 5 баллов.
    - Отфильтруйте студентов, у которых english_score больше 80.
"""